analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/afe_adc_one_regs.h
#define MXC_F_AFE_ADC_ONE_GP0_CTRL_GP0_ISEL_POS        4 /**< GP0_CTRL_GP0_ISEL Position */
#define MXC_F_AFE_ADC_ONE_GP0_CTRL_GP0_ISEL            ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ONE_GP0_CTRL_GP0_ISEL_POS)) /**< GP0_CTRL_GP0_ISEL Mask */

#define MXC_F_AFE_ADC_ONE_GP0_CTRL_GP0_DIR_POS         6 /**< GP0_CTRL_GP0_DIR Position */
#define MXC_F_AFE_ADC_ONE_GP0_CTRL_GP0_DIR             ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ONE_GP0_CTRL_GP0_DIR_POS)) /**< GP0_CTRL_GP0_DIR Mask */

/**@} end of group AFE_ADC_ONE_GP0_CTRL_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_GP1_CTRL AFE_ADC_ONE_GP1_CTRL
 * @brief    Control behavior of GPIO1
 * @{
 */
#define MXC_F_AFE_ADC_ONE_GP1_CTRL_GP1_OSEL_POS        0 /**< GP1_CTRL_GP1_OSEL Position */
#define MXC_F_AFE_ADC_ONE_GP1_CTRL_GP1_OSEL            ((uint8_t)(0x7UL << MXC_F_AFE_ADC_ONE_GP1_CTRL_GP1_OSEL_POS)) /**< GP1_CTRL_GP1_OSEL Mask */

#define MXC_F_AFE_ADC_ONE_GP1_CTRL_GP1_ISEL_POS        4 /**< GP1_CTRL_GP1_ISEL Position */
#define MXC_F_AFE_ADC_ONE_GP1_CTRL_GP1_ISEL            ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ONE_GP1_CTRL_GP1_ISEL_POS)) /**< GP1_CTRL_GP1_ISEL Mask */

#define MXC_F_AFE_ADC_ONE_GP1_CTRL_GP1_DIR_POS         6 /**< GP1_CTRL_GP1_DIR Position */
#define MXC_F_AFE_ADC_ONE_GP1_CTRL_GP1_DIR             ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ONE_GP1_CTRL_GP1_DIR_POS)) /**< GP1_CTRL_GP1_DIR Mask */

/**@} end of group AFE_ADC_ONE_GP1_CTRL_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_GP_CONV AFE_ADC_ONE_GP_CONV
 * @brief    Select conversion to perform when initiated by GPIO
 * @{
 */
#define MXC_F_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_POS     0 /**< GP_CONV_GP_CONV_TYPE Position */
#define MXC_F_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE         ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_POS)) /**< GP_CONV_GP_CONV_TYPE Mask */
#define MXC_V_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_SINGLE  ((uint8_t)0x0UL) /**< GP_CONV_GP_CONV_TYPE_SINGLE Value */
#define MXC_S_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_SINGLE  (MXC_V_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_SINGLE << MXC_F_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_POS) /**< GP_CONV_GP_CONV_TYPE_SINGLE Setting */
#define MXC_V_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_CONTINUOUS ((uint8_t)0x1UL) /**< GP_CONV_GP_CONV_TYPE_CONTINUOUS Value */
#define MXC_S_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_CONTINUOUS (MXC_V_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_CONTINUOUS << MXC_F_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_POS) /**< GP_CONV_GP_CONV_TYPE_CONTINUOUS Setting */
#define MXC_V_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_DUTY_CYCLED_1_TO_4 ((uint8_t)0x2UL) /**< GP_CONV_GP_CONV_TYPE_DUTY_CYCLED_1_TO_4 Value */
#define MXC_S_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_DUTY_CYCLED_1_TO_4 (MXC_V_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_DUTY_CYCLED_1_TO_4 << MXC_F_AFE_ADC_ONE_GP_CONV_GP_CONV_TYPE_POS) /**< GP_CONV_GP_CONV_TYPE_DUTY_CYCLED_1_TO_4 Setting */

#define MXC_F_AFE_ADC_ONE_GP_CONV_GP_DEST_POS          4 /**< GP_CONV_GP_DEST Position */
#define MXC_F_AFE_ADC_ONE_GP_CONV_GP_DEST              ((uint8_t)(0x7UL << MXC_F_AFE_ADC_ONE_GP_CONV_GP_DEST_POS)) /**< GP_CONV_GP_DEST Mask */

/**@} end of group AFE_ADC_ONE_GP_CONV_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_GP_SEQ_ADDR AFE_ADC_ONE_GP_SEQ_ADDR
 * @brief    Select target sequencer address initiated by GPIO
 * @{
 */
#define MXC_F_AFE_ADC_ONE_GP_SEQ_ADDR_GP_SEQ_ADDR_POS  0 /**< GP_SEQ_ADDR_GP_SEQ_ADDR Position */
#define MXC_F_AFE_ADC_ONE_GP_SEQ_ADDR_GP_SEQ_ADDR      ((uint8_t)(0x7FUL << MXC_F_AFE_ADC_ONE_GP_SEQ_ADDR_GP_SEQ_ADDR_POS)) /**< GP_SEQ_ADDR_GP_SEQ_ADDR Mask */

/**@} end of group AFE_ADC_ONE_GP_SEQ_ADDR_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_FILTER AFE_ADC_ONE_FILTER
 * @brief    Select conversion data rate and filter behavior
 * @{
 */
#define MXC_F_AFE_ADC_ONE_FILTER_RATE_POS              0 /**< FILTER_RATE Position */
#define MXC_F_AFE_ADC_ONE_FILTER_RATE                  ((uint8_t)(0xFUL << MXC_F_AFE_ADC_ONE_FILTER_RATE_POS)) /**< FILTER_RATE Mask */

#define MXC_F_AFE_ADC_ONE_FILTER_LINEF_POS             4 /**< FILTER_LINEF Position */
#define MXC_F_AFE_ADC_ONE_FILTER_LINEF                 ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ONE_FILTER_LINEF_POS)) /**< FILTER_LINEF Mask */
#define MXC_V_AFE_ADC_ONE_FILTER_LINEF_SIMULTANEOUS_FIR_REJECT_50HZ_AND_60HZ ((uint8_t)0x0UL) /**< FILTER_LINEF_SIMULTANEOUS_FIR_REJECT_50HZ_AND_60HZ Value */
#define MXC_S_AFE_ADC_ONE_FILTER_LINEF_SIMULTANEOUS_FIR_REJECT_50HZ_AND_60HZ (MXC_V_AFE_ADC_ONE_FILTER_LINEF_SIMULTANEOUS_FIR_REJECT_50HZ_AND_60HZ << MXC_F_AFE_ADC_ONE_FILTER_LINEF_POS) /**< FILTER_LINEF_SIMULTANEOUS_FIR_REJECT_50HZ_AND_60HZ Setting */
#define MXC_V_AFE_ADC_ONE_FILTER_LINEF_FIR_REJECT_50HZ ((uint8_t)0x1UL) /**< FILTER_LINEF_FIR_REJECT_50HZ Value */
#define MXC_S_AFE_ADC_ONE_FILTER_LINEF_FIR_REJECT_50HZ (MXC_V_AFE_ADC_ONE_FILTER_LINEF_FIR_REJECT_50HZ << MXC_F_AFE_ADC_ONE_FILTER_LINEF_POS) /**< FILTER_LINEF_FIR_REJECT_50HZ Setting */
#define MXC_V_AFE_ADC_ONE_FILTER_LINEF_FIR_REJECT_60HZ ((uint8_t)0x2UL) /**< FILTER_LINEF_FIR_REJECT_60HZ Value */
#define MXC_S_AFE_ADC_ONE_FILTER_LINEF_FIR_REJECT_60HZ (MXC_V_AFE_ADC_ONE_FILTER_LINEF_FIR_REJECT_60HZ << MXC_F_AFE_ADC_ONE_FILTER_LINEF_POS) /**< FILTER_LINEF_FIR_REJECT_60HZ Setting */
#define MXC_V_AFE_ADC_ONE_FILTER_LINEF_SINC4           ((uint8_t)0x3UL) /**< FILTER_LINEF_SINC4 Value */
#define MXC_S_AFE_ADC_ONE_FILTER_LINEF_SINC4           (MXC_V_AFE_ADC_ONE_FILTER_LINEF_SINC4 << MXC_F_AFE_ADC_ONE_FILTER_LINEF_POS) /**< FILTER_LINEF_SINC4 Setting */

/**@} end of group AFE_ADC_ONE_FILTER_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_CTRL AFE_ADC_ONE_CTRL
 * @brief    Select clock source, data format, ref inputs and ref buffers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_CTRL_REF_SEL_POS             0 /**< CTRL_REF_SEL Position */
#define MXC_F_AFE_ADC_ONE_CTRL_REF_SEL                 ((uint8_t)(0x7UL << MXC_F_AFE_ADC_ONE_CTRL_REF_SEL_POS)) /**< CTRL_REF_SEL Mask */
#define MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF0P_AND_REF0N ((uint8_t)0x0UL) /**< CTRL_REF_SEL_REF0P_AND_REF0N Value */
#define MXC_S_AFE_ADC_ONE_CTRL_REF_SEL_REF0P_AND_REF0N (MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF0P_AND_REF0N << MXC_F_AFE_ADC_ONE_CTRL_REF_SEL_POS) /**< CTRL_REF_SEL_REF0P_AND_REF0N Setting */
#define MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF1P_AND_REF1N ((uint8_t)0x1UL) /**< CTRL_REF_SEL_REF1P_AND_REF1N Value */
#define MXC_S_AFE_ADC_ONE_CTRL_REF_SEL_REF1P_AND_REF1N (MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF1P_AND_REF1N << MXC_F_AFE_ADC_ONE_CTRL_REF_SEL_POS) /**< CTRL_REF_SEL_REF1P_AND_REF1N Setting */
#define MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF2P_AND_REF2N ((uint8_t)0x2UL) /**< CTRL_REF_SEL_REF2P_AND_REF2N Value */
#define MXC_S_AFE_ADC_ONE_CTRL_REF_SEL_REF2P_AND_REF2N (MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF2P_AND_REF2N << MXC_F_AFE_ADC_ONE_CTRL_REF_SEL_POS) /**< CTRL_REF_SEL_REF2P_AND_REF2N Setting */
#define MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_AVDD_AND_AGND   ((uint8_t)0x3UL) /**< CTRL_REF_SEL_AVDD_AND_AGND Value */
#define MXC_S_AFE_ADC_ONE_CTRL_REF_SEL_AVDD_AND_AGND   (MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_AVDD_AND_AGND << MXC_F_AFE_ADC_ONE_CTRL_REF_SEL_POS) /**< CTRL_REF_SEL_AVDD_AND_AGND Setting */
#define MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF0P_AND_AGND  ((uint8_t)0x4UL) /**< CTRL_REF_SEL_REF0P_AND_AGND Value */
#define MXC_S_AFE_ADC_ONE_CTRL_REF_SEL_REF0P_AND_AGND  (MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF0P_AND_AGND << MXC_F_AFE_ADC_ONE_CTRL_REF_SEL_POS) /**< CTRL_REF_SEL_REF0P_AND_AGND Setting */
#define MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF1P_AND_AGND  ((uint8_t)0x5UL) /**< CTRL_REF_SEL_REF1P_AND_AGND Value */
#define MXC_S_AFE_ADC_ONE_CTRL_REF_SEL_REF1P_AND_AGND  (MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF1P_AND_AGND << MXC_F_AFE_ADC_ONE_CTRL_REF_SEL_POS) /**< CTRL_REF_SEL_REF1P_AND_AGND Setting */
#define MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF2P_AND_AGND  ((uint8_t)0x6UL) /**< CTRL_REF_SEL_REF2P_AND_AGND Value */
#define MXC_S_AFE_ADC_ONE_CTRL_REF_SEL_REF2P_AND_AGND  (MXC_V_AFE_ADC_ONE_CTRL_REF_SEL_REF2P_AND_AGND << MXC_F_AFE_ADC_ONE_CTRL_REF_SEL_POS) /**< CTRL_REF_SEL_REF2P_AND_AGND Setting */

#define MXC_F_AFE_ADC_ONE_CTRL_REFBUFN_EN_POS          3 /**< CTRL_REFBUFN_EN Position */
#define MXC_F_AFE_ADC_ONE_CTRL_REFBUFN_EN              ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_CTRL_REFBUFN_EN_POS)) /**< CTRL_REFBUFN_EN Mask */

#define MXC_F_AFE_ADC_ONE_CTRL_REFBUFP_EN_POS          4 /**< CTRL_REFBUFP_EN Position */
#define MXC_F_AFE_ADC_ONE_CTRL_REFBUFP_EN              ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_CTRL_REFBUFP_EN_POS)) /**< CTRL_REFBUFP_EN Mask */

