analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/afe_adc_one_regs.h
/**@} end of group AFE_ADC_ONE_PART_ID_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SYSC_SEL AFE_ADC_ONE_SYSC_SEL
 * @brief    System Calibration Selection
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_0_POS      0 /**< SYSC_SEL_SYSC_SEL_0 Position */
#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_0          ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_0_POS)) /**< SYSC_SEL_SYSC_SEL_0 Mask */

#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_1_POS      2 /**< SYSC_SEL_SYSC_SEL_1 Position */
#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_1          ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_1_POS)) /**< SYSC_SEL_SYSC_SEL_1 Mask */

#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_2_POS      4 /**< SYSC_SEL_SYSC_SEL_2 Position */
#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_2          ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_2_POS)) /**< SYSC_SEL_SYSC_SEL_2 Mask */

#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_3_POS      6 /**< SYSC_SEL_SYSC_SEL_3 Position */
#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_3          ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_3_POS)) /**< SYSC_SEL_SYSC_SEL_3 Mask */

#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_4_POS      8 /**< SYSC_SEL_SYSC_SEL_4 Position */
#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_4          ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_4_POS)) /**< SYSC_SEL_SYSC_SEL_4 Mask */

#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_5_POS      10 /**< SYSC_SEL_SYSC_SEL_5 Position */
#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_5          ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_5_POS)) /**< SYSC_SEL_SYSC_SEL_5 Mask */

#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_6_POS      12 /**< SYSC_SEL_SYSC_SEL_6 Position */
#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_6          ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_6_POS)) /**< SYSC_SEL_SYSC_SEL_6 Mask */

#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_7_POS      14 /**< SYSC_SEL_SYSC_SEL_7 Position */
#define MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_7          ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ONE_SYSC_SEL_SYSC_SEL_7_POS)) /**< SYSC_SEL_SYSC_SEL_7 Mask */

/**@} end of group AFE_ADC_ONE_SYSC_SEL_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SYS_OFF_A AFE_ADC_ONE_SYS_OFF_A
 * @brief    System offset A calibration value to subtract from conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SYS_OFF_A_SYS_OFF_A_POS      0 /**< SYS_OFF_A_SYS_OFF_A Position */
#define MXC_F_AFE_ADC_ONE_SYS_OFF_A_SYS_OFF_A          ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SYS_OFF_A_SYS_OFF_A_POS)) /**< SYS_OFF_A_SYS_OFF_A Mask */

/**@} end of group AFE_ADC_ONE_SYS_OFF_A_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SYS_OFF_B AFE_ADC_ONE_SYS_OFF_B
 * @brief    System offset B calibration value to subtract from conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SYS_OFF_B_SYS_OFF_B_POS      0 /**< SYS_OFF_B_SYS_OFF_B Position */
#define MXC_F_AFE_ADC_ONE_SYS_OFF_B_SYS_OFF_B          ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SYS_OFF_B_SYS_OFF_B_POS)) /**< SYS_OFF_B_SYS_OFF_B Mask */

/**@} end of group AFE_ADC_ONE_SYS_OFF_B_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SYS_GAIN_A AFE_ADC_ONE_SYS_GAIN_A
 * @brief    System gain calibration A value to scale offset corrected conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SYS_GAIN_A_SYS_GAIN_A_POS    0 /**< SYS_GAIN_A_SYS_GAIN_A Position */
#define MXC_F_AFE_ADC_ONE_SYS_GAIN_A_SYS_GAIN_A        ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SYS_GAIN_A_SYS_GAIN_A_POS)) /**< SYS_GAIN_A_SYS_GAIN_A Mask */

/**@} end of group AFE_ADC_ONE_SYS_GAIN_A_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SYS_GAIN_B AFE_ADC_ONE_SYS_GAIN_B
 * @brief    System gain calibration B value to scale offset corrected conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SYS_GAIN_B_SYS_GAIN_B_POS    0 /**< SYS_GAIN_B_SYS_GAIN_B Position */
#define MXC_F_AFE_ADC_ONE_SYS_GAIN_B_SYS_GAIN_B        ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SYS_GAIN_B_SYS_GAIN_B_POS)) /**< SYS_GAIN_B_SYS_GAIN_B Mask */

/**@} end of group AFE_ADC_ONE_SYS_GAIN_B_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SELF_OFF AFE_ADC_ONE_SELF_OFF
 * @brief    Self-calibration offset value to subtract from conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SELF_OFF_SELF_OFF_POS        0 /**< SELF_OFF_SELF_OFF Position */
#define MXC_F_AFE_ADC_ONE_SELF_OFF_SELF_OFF            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SELF_OFF_SELF_OFF_POS)) /**< SELF_OFF_SELF_OFF Mask */

/**@} end of group AFE_ADC_ONE_SELF_OFF_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SELF_GAIN_1 AFE_ADC_ONE_SELF_GAIN_1
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 1
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_1_SELF_GAIN_1_POS  0 /**< SELF_GAIN_1_SELF_GAIN_1 Position */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_1_SELF_GAIN_1      ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SELF_GAIN_1_SELF_GAIN_1_POS)) /**< SELF_GAIN_1_SELF_GAIN_1 Mask */

/**@} end of group AFE_ADC_ONE_SELF_GAIN_1_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SELF_GAIN_2 AFE_ADC_ONE_SELF_GAIN_2
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 2
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_2_SELF_GAIN_1_POS  0 /**< SELF_GAIN_2_SELF_GAIN_1 Position */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_2_SELF_GAIN_1      ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SELF_GAIN_2_SELF_GAIN_1_POS)) /**< SELF_GAIN_2_SELF_GAIN_1 Mask */

/**@} end of group AFE_ADC_ONE_SELF_GAIN_2_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SELF_GAIN_4 AFE_ADC_ONE_SELF_GAIN_4
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 4
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_4_SELF_GAIN_4_POS  0 /**< SELF_GAIN_4_SELF_GAIN_4 Position */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_4_SELF_GAIN_4      ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SELF_GAIN_4_SELF_GAIN_4_POS)) /**< SELF_GAIN_4_SELF_GAIN_4 Mask */

