analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/afe_adc_one_regs.h
/**@} end of group AFE_ADC_ONE_SELF_GAIN_4_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SELF_GAIN_8 AFE_ADC_ONE_SELF_GAIN_8
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 8
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_8_SELF_GAIN_8_POS  0 /**< SELF_GAIN_8_SELF_GAIN_8 Position */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_8_SELF_GAIN_8      ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SELF_GAIN_8_SELF_GAIN_8_POS)) /**< SELF_GAIN_8_SELF_GAIN_8 Mask */

/**@} end of group AFE_ADC_ONE_SELF_GAIN_8_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SELF_GAIN_16 AFE_ADC_ONE_SELF_GAIN_16
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 16
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_16_SELF_GAIN_16_POS 0 /**< SELF_GAIN_16_SELF_GAIN_16 Position */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_16_SELF_GAIN_16    ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SELF_GAIN_16_SELF_GAIN_16_POS)) /**< SELF_GAIN_16_SELF_GAIN_16 Mask */

/**@} end of group AFE_ADC_ONE_SELF_GAIN_16_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SELF_GAIN_32 AFE_ADC_ONE_SELF_GAIN_32
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 32
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_32_SELF_GAIN_32_POS 0 /**< SELF_GAIN_32_SELF_GAIN_32 Position */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_32_SELF_GAIN_32    ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SELF_GAIN_32_SELF_GAIN_32_POS)) /**< SELF_GAIN_32_SELF_GAIN_32 Mask */

/**@} end of group AFE_ADC_ONE_SELF_GAIN_32_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SELF_GAIN_64 AFE_ADC_ONE_SELF_GAIN_64
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 64
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_64_SELF_GAIN_64_POS 0 /**< SELF_GAIN_64_SELF_GAIN_64 Position */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_64_SELF_GAIN_64    ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SELF_GAIN_64_SELF_GAIN_64_POS)) /**< SELF_GAIN_64_SELF_GAIN_64 Mask */

/**@} end of group AFE_ADC_ONE_SELF_GAIN_64_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SELF_GAIN_128 AFE_ADC_ONE_SELF_GAIN_128
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 128
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_128_LTHRESH0_POS   0 /**< SELF_GAIN_128_LTHRESH0 Position */
#define MXC_F_AFE_ADC_ONE_SELF_GAIN_128_LTHRESH0       ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_SELF_GAIN_128_LTHRESH0_POS)) /**< SELF_GAIN_128_LTHRESH0 Mask */

/**@} end of group AFE_ADC_ONE_SELF_GAIN_128_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_LTHRESH0 AFE_ADC_ONE_LTHRESH0
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_LTHRESH0_LTHRESH_POS         0 /**< LTHRESH0_LTHRESH Position */
#define MXC_F_AFE_ADC_ONE_LTHRESH0_LTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_LTHRESH0_LTHRESH_POS)) /**< LTHRESH0_LTHRESH Mask */

/**@} end of group AFE_ADC_ONE_LTHRESH0_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_LTHRESH1 AFE_ADC_ONE_LTHRESH1
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_LTHRESH1_LTHRESH_POS         0 /**< LTHRESH1_LTHRESH Position */
#define MXC_F_AFE_ADC_ONE_LTHRESH1_LTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_LTHRESH1_LTHRESH_POS)) /**< LTHRESH1_LTHRESH Mask */

/**@} end of group AFE_ADC_ONE_LTHRESH1_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_LTHRESH2 AFE_ADC_ONE_LTHRESH2
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_LTHRESH2_LTHRESH_POS         0 /**< LTHRESH2_LTHRESH Position */
#define MXC_F_AFE_ADC_ONE_LTHRESH2_LTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_LTHRESH2_LTHRESH_POS)) /**< LTHRESH2_LTHRESH Mask */

/**@} end of group AFE_ADC_ONE_LTHRESH2_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_LTHRESH3 AFE_ADC_ONE_LTHRESH3
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_LTHRESH3_LTHRESH_POS         0 /**< LTHRESH3_LTHRESH Position */
#define MXC_F_AFE_ADC_ONE_LTHRESH3_LTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_LTHRESH3_LTHRESH_POS)) /**< LTHRESH3_LTHRESH Mask */

/**@} end of group AFE_ADC_ONE_LTHRESH3_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_LTHRESH4 AFE_ADC_ONE_LTHRESH4
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_LTHRESH4_LTHRESH_POS         0 /**< LTHRESH4_LTHRESH Position */
#define MXC_F_AFE_ADC_ONE_LTHRESH4_LTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_LTHRESH4_LTHRESH_POS)) /**< LTHRESH4_LTHRESH Mask */

/**@} end of group AFE_ADC_ONE_LTHRESH4_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_LTHRESH5 AFE_ADC_ONE_LTHRESH5
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_LTHRESH5_LTHRESH_POS         0 /**< LTHRESH5_LTHRESH Position */
#define MXC_F_AFE_ADC_ONE_LTHRESH5_LTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_LTHRESH5_LTHRESH_POS)) /**< LTHRESH5_LTHRESH Mask */

/**@} end of group AFE_ADC_ONE_LTHRESH5_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_LTHRESH6 AFE_ADC_ONE_LTHRESH6
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_LTHRESH6_LTHRESH_POS         0 /**< LTHRESH6_LTHRESH Position */
#define MXC_F_AFE_ADC_ONE_LTHRESH6_LTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_LTHRESH6_LTHRESH_POS)) /**< LTHRESH6_LTHRESH Mask */

/**@} end of group AFE_ADC_ONE_LTHRESH6_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_LTHRESH7 AFE_ADC_ONE_LTHRESH7
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_LTHRESH7_LTHRESH_POS         0 /**< LTHRESH7_LTHRESH Position */
#define MXC_F_AFE_ADC_ONE_LTHRESH7_LTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_LTHRESH7_LTHRESH_POS)) /**< LTHRESH7_LTHRESH Mask */

/**@} end of group AFE_ADC_ONE_LTHRESH7_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UTHRESH0 AFE_ADC_ONE_UTHRESH0
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UTHRESH0_UTHRESH_POS         0 /**< UTHRESH0_UTHRESH Position */
#define MXC_F_AFE_ADC_ONE_UTHRESH0_UTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_UTHRESH0_UTHRESH_POS)) /**< UTHRESH0_UTHRESH Mask */

